@client.on(events.NewMessage(pattern=r"^\.م8$"))
async def menu8(event):
    if not event.out: return
    klisha = (
        "★────────☭────────★\n"
        "   ☭ • 𝑆𝑂𝑈𝑅𝐶𝐸 𝑁𝐸𝑇𝐻𝑅𝑂𝑁 • ☭\n"
        "                  ☭ • سورس نيثرون • ☭\n"
        "★────────☭────────★\n\n"
        "⚙️ أوامر المتغيرات والتحكم:\n\n"
        "• `$نبض` ، `$تحميل` ، `$قلب` ، `$بار` \n\n"
        "⚙️ إعدادات الأمان:\n"
        "• `.وقت الحركة (2-5)` \n"
        "➥ لتغيير سرعة الأنميشن وتجنب الحظر\n\n"
        "★────────☭────────★\n"
        "💬 حالياً السرعة مضبوطة لضمان أمان حسابك.\n"
        "★────────☭────────★"
    )
    await event.edit(klisha)
