@client.on(events.NewMessage(outgoing=True, pattern=r"^\.م2$"))
async def menu2(event):
    text = (
        "★────────☭────────★\n"
        "   ☭ • 𝐼𝑅𝐴𝑄𝑇𝐻𝑂𝑂𝑁 • ☭\n"
        "                  ☭ • سورس عراق ثون • ☭\n"
        "★────────☭────────★\n\n"
        "🛡 **أوامر حماية وتفاعل المجموعات:**\n\n"
        "• `.تفعيل مجموعه` ➥ لتفعيل النظام والعداد\n"
        "• `.كتم` ➥ لكتم الشخص (بالرد)\n"
        "• `.فك كتم` ➥ لفك كتم الشخص (بالرد)\n"
        "• `.تفاعلي` ➥ عرض معلوماتك ورسائلك\n"
        "• `.كشف` ➥ كشف حساب الشخص وصورته\n\n"
        "★────────☭────────★\n"
        "💬 ملاحظة: الأوامر تعمل داخل المجموعات المفعلة فقط."
    )
    await event.edit(text)
