import __main__
from telethon import events

# جلب الكلاينت
client = getattr(__main__, 'client', None)

@client.on(events.NewMessage(outgoing=True, pattern=r"^\.الاوامر$"))
async def all_menus(event):
    klisha = (
        "★────────☭────────★\n"
        "   ☭ • 𝐼𝑅𝐴𝑄𝑇𝐻𝑂𝑂𝑁 • ☭\n"
        "                  ☭ • سورس عراق ثون • ☭\n"
        "★────────☭────────★\n"
        " •〔.م1〕⌯  اوامر الخاص \n"
        " •〔.م2〕⌯ اوامر المجموعات\n"
        " •〔.م3〕⌯ اوامر المتحرك والمتغيرات\n"
        " •〔.م4〕⌯ اوامر الوقتي \n"
        " •〔.م5〕⌯ اوامر التغيير التلقائي\n"
        " •〔.م6〕⌯ اوامر الذاتيه\n"
        " •〔.م7〕⌯ اوامر التحميل\n"
        " •〔.م8〕⌯ اوامر الانتحال والنسخ\n"
        " •〔.م9〕⌯ اوامر الوهمي \n"
        " •〔.م10〕⌯ اوامر النشر \n"
        " •〔.م11〕⌯ اوامر الاذاعة\n"
        " •〔.م12〕⌯ قريباً..\n"
        " •〔.م13〕⌯ قريباً..\n"
        " •〔.م14〕⌯ قريباً..\n"
        "★────────☭────────★"
    )

    # تعديل فوري للنص فقط (أسرع استجابة ممكنة)
    await event.edit(klisha)
