import __main__, asyncio
from telethon import events

# جلب الكلاينت
client = getattr(__main__, 'client', None)
VORTEX = ["◜", "◝", "◞", "◟"]

@client.on(events.NewMessage(outgoing=True, pattern=r"^\.م7$"))
async def menu7(event):
    # حط الرابط المباشر اللي أخذته من الموقع هنا
    pic_link = "https://files.catbox.moe/2bi5k8.mp4" 

    klisha = (
        "★────────☭────────★\n"
        "   ☭ • 𝐼𝑅𝐴𝑄𝑇𝐻𝑂𝑂𝑁 • ☭\n"
        "                  ☭ • سورس عراق ثون • ☭\n"
        "★────────☭────────★\n\n"
        "⚙️ أوامر الوقتي والتحكم:\n\n"
        "• .وقتي اسم\n"
        "➥ لتفعيل الوقت بتوقيت العراق في اسمك\n\n"
        "• .وقتي بايو\n"
        "➥ لتفعيل الوقت بتوقيت العراق في بايوك\n\n"
        "• .ايقاف وقتي\n"
        "➥ لإيقاف الوقت وتنظيف الحساب فوراً\n\n"
        "★────────☭────────★\n"
        "💬 ملاحظة: تم البرمجة بواسطة IraqThoon"
    )

    # أنيميشن الدوامة
    for i in range(6): 
        f = VORTEX[i % 4]
        await event.edit(f"**{f} جـاري فـتـح الـمـنـيـو {f}**")
        await asyncio.sleep(0.2)

    await event.delete()

    try:
        # إرسال الملف مع خاصية التشغيل التلقائي (تلقائي GIF)
        await client.send_file(
            event.chat_id, 
            pic_link, 
            caption=klisha,
            force_document=False, # لإرسالها كصورة/فيديو وليس ملف
            buttons=None
        )
    except Exception as e:
        await client.send_message(event.chat_id, klisha)
