
from telethon import events
import __main__

# جلب الكلاينت المحقون من الميكر
client = getattr(__main__, 'client', None)

@client.on(events.NewMessage(pattern=r"^\.م7$"))
async def menu7(event):
    # يشتغل فقط إذا أنت كتبت الأمر
    if not event.out:
        return

    klisha = (
        "★────────☭────────★\n"
        "   ☭ • 𝑆𝑂𝑈𝑅𝐶𝐸 𝑁𝐸𝑇𝐻𝑅𝑂𝑁 • ☭\n"
        "                  ☭ • سورس نيثرون • ☭\n"
        "★────────☭────────★\n\n"
        "⚙️ أوامر الوقتي والتحكم:\n\n"
        "• .وقتي اسم\n"
        "➥ لتفعيل الوقت بتوقيت العراق في اسمك\n\n"
        "• .وقتي بايو\n"
        "➥ لتفعيل الوقت بتوقيت العراق في بايوك\n\n"
        "• .ايقاف وقتي\n"
        "➥ لإيقاف الوقت وتنظيف الحساب فوراً\n\n"
        "★────────☭────────★\n"
        "💬 ملاحظة: تم البرمجة بواسطة نيثرون"
    )

    await event.edit(klisha)
