from telethon import events
import __main__

client = __main__.client

@client.on(events.NewMessage(pattern=r"^\.م4$"))
async def m4_command(event):
    m4_text = (
        "★────────☭────────★\n"
        "   ☭ • 𝑆𝑂𝑈𝑅𝐶𝐸 𝑁𝐸𝑇𝐻𝑅𝑂𝑁 • ☭\n"
        "                  ☭ • سورس نيثرون • ☭\n"
        "★────────☭────────★\n\n"
        "🎮 **أوامر الألعاب والتسلية:**\n\n"
        "• `.xo` (بالرد) \n"
        "➥ بدء تحدي اكس او مع صديق\n\n"
        "• `.xo` (بدون رد)\n"
        "➥ بدء تحدي اكس او ضد البوت المطور\n\n"
        "• `.تفكيك` \n"
        "➥ لعبة تفكيك الكلمات لسرعة الكتابة\n\n"
        "★────────☭────────★\n"
        "💬 **ملاحظة:** الألعاب تعمل عبر البوت المساعد.\n"
    )
    await event.edit(m4_text)
